FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/ДатыЗапретаРедактирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДатыЗапретаРедактирования</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗапретРедактированияРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапретРедактированияКорректировок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НоваяДатаЗапретРедактированияРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>Периодичность</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
					<Comment>Неделя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
					<Comment>Декада</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
					<Comment>Месяц</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
					<Comment>Квартал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
					<Comment>Год</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Произвольный</Name>
					<Comment>Произвольный</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/CommonModules/Мотивация/Ext/Module.bsl
#Область Модифицированность	
// Проверяет на изменение объекта и устанавливает новые значения автора и даты последнего измеенения

Процедура МотивацияПередЗаписьюДокументовПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Не Источник.Ссылка.Пустая() Тогда
		
		Модифицирован =	ПроверитьМодифицированностьШапки(Источник);
		
		Если Не Модифицирован Тогда
			Модифицирован =	ПроверитьМодифицированностьТабличныхЧастей(Источник);
		КонецЕсли;
		
		Если Модифицирован = Неопределено Тогда
			Модифицирован = Ложь;
		КонецЕсли;	
		
		Если Модифицирован Тогда
			Источник.АвторПоследнегоИзменения = ПараметрыСеанса.Пользователь;
			Источник.ДатаПоследнегоИзменения  = ТекущаяДата();
		КонецЕсли;
	КонецЕсли;			
	
КонецПроцедуры

Функция ПроверитьМодифицированностьШапки(Источник)
	
	ИмяДокумента = Источник.Метаданные().Имя;	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	Документ."+ ИмяДокумента +"
	|ГДЕ
	|	Документ." + ИмяДокумента + ".Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		СписокРеквизитов = Источник.Метаданные().Реквизиты;
		
		Для Каждого текРеквизит из СписокРеквизитов Цикл
			Если Результат[текРеквизит.Имя] <> Источник[текРеквизит.Имя] Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
		
		СписокСтандартныхРеквизитов = Источник.Метаданные().СтандартныеРеквизиты;
		
		Для Каждого текРеквизит из СписокСтандартныхРеквизитов Цикл
			Если Результат[текРеквизит.Имя] <> Источник[текРеквизит.Имя] Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

Функция ПроверитьМодифицированностьТабличныхЧастей(Источник)
	
	ИмяДокумента = Источник.Метаданные().Имя;	
	
	Для Каждого ТабЧасть Из Источник.Метаданные().ТабличныеЧасти Цикл
		
		ИмяТабЧасти = ТабЧасть.Имя;
		ИмяВыборки = "Документ." + ИмяДокумента + "." + ИмяТабЧасти;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	 *
		|ИЗ
		|	" + ИмяВыборки + "
		|ГДЕ
		|	" + ИмяВыборки + ".Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Пока Результат.Следующий() Цикл
			СписокРеквизитов = Источник.Метаданные().ТабличныеЧасти[ИмяТабЧасти].Реквизиты;
			
			Для Каждого текРеквизит из СписокРеквизитов Цикл
				Попытка
					Если Результат[текРеквизит.Имя] <> Источник[ИмяТабЧасти][Результат.НомерСтроки -1][текРеквизит.Имя] Тогда
						Возврат Истина;
					КонецЕсли;
				Исключение
					Возврат Истина;
				КонецПопытки;
			КонецЦикла;
			
		КонецЦикла;	
		
		Возврат Ложь;
	КонецЦикла;
	
КонецФункции	

#КонецОбласти

Процедура СообщитьПользователю(ТекстСообщения, Поле) Экспорт
	
	Сообщение =Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Поле=Поле;
	Сообщение.ПутьКДанным = "Объект";
	Сообщение.Сообщить();
	
КонецПроцедуры	

#Область ОбработчикиПоДатеЗапрете	

Процедура ПроверитьДоступностьОбъектаПоДатеЗапрета(ДокОбъект, ДокФорма, Период,Знач Организация=Неопределено,ПодразделениеКомпании) Экспорт
	
	Если ПустаяСтрока(Организация) Тогда
		Организация=Справочники.Организации.ОсновнаяОрганизация;
	КонецЕсли;
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	ДатыЗапретаРедактирования.ЗапретРедактированияРасчета КАК ЗапретРедактированияРасчета,
	|	ДатыЗапретаРедактирования.ЗапретРедактированияКорректировок КАК ЗапретРедактированияКорректировок,
	|	0 КАК Приоритет
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрСведений.ДатыЗапретаРедактирования КАК ДатыЗапретаРедактирования
	|ГДЕ
	|	ДатыЗапретаРедактирования.Месяц = &Месяц
	|	И ДатыЗапретаРедактирования.ПодразделениеКомпании = &Подразделение
	|	И (НЕ ДатыЗапретаРедактирования.ЗапретРедактированияРасчета = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ НЕ ДатыЗапретаРедактирования.ЗапретРедактированияКорректировок = ДАТАВРЕМЯ(1, 1, 1))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДатыЗапретаРедактирования.ЗапретРедактированияРасчета,
	|	ДатыЗапретаРедактирования.ЗапретРедактированияКорректировок,
	|	1
	|ИЗ
	|	РегистрСведений.ДатыЗапретаРедактирования КАК ДатыЗапретаРедактирования
	|ГДЕ
	|	ДатыЗапретаРедактирования.Месяц = &Месяц
	|	И ДатыЗапретаРедактирования.ПодразделениеКомпании = &ПустоеПодразделение
	|	И (НЕ ДатыЗапретаРедактирования.ЗапретРедактированияРасчета = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ НЕ ДатыЗапретаРедактирования.ЗапретРедактированияКорректировок = ДАТАВРЕМЯ(1, 1, 1))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ЗапретРедактированияРасчета КАК ЗапретРедактированияРасчета,
	|	ВТ.ЗапретРедактированияКорректировок КАК ЗапретРедактированияКорректировок,
	|	ВТ.Приоритет КАК Приоритет
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ЗапретРедактированияРасчета,
	|	ВТ.ЗапретРедактированияКорректировок,
	|	ВТ.Приоритет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет");
	
	Запрос.УстановитьПараметр("Месяц",НачалоМесяца(Период));
	Запрос.УстановитьПараметр("Подразделение",ПодразделениеКомпании);
	Запрос.УстановитьПараметр("ПустоеПодразделение",Справочники.ПодразделенияКомпании.ПустаяСсылка());
	
	Результат=Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Выб = Результат.Выбрать();
		
		Если Выб.Следующий() Тогда
			
			Если (ТекущаяДата()<=Выб.ЗапретРедактированияРасчета)
				или (ТекущаяДата()<=Выб.ЗапретРедактированияКорректировок) Тогда
				
				ДокФорма.ТолькоПросмотр = Ложь;
				
			Иначе
				
				Запрос=Новый Запрос("ВЫБРАТЬ
				|	0 КАК Приоритет,
				|	ДатыЗапретаРедактирования.НоваяДатаЗапретРедактированияРасчета КАК НоваяДатаЗапретРедактированияРасчета
				|ПОМЕСТИТЬ ВТ
				|ИЗ
				|	РегистрСведений.ДатыЗапретаРедактирования КАК ДатыЗапретаРедактирования
				|ГДЕ
				|	ДатыЗапретаРедактирования.Месяц = &Месяц
				|	И ДатыЗапретаРедактирования.ПодразделениеКомпании = &Подразделение
				|	И НЕ ДатыЗапретаРедактирования.НоваяДатаЗапретРедактированияРасчета = ДАТАВРЕМЯ(1, 1, 1)
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	1,
				|	ДатыЗапретаРедактирования.НоваяДатаЗапретРедактированияРасчета
				|ИЗ
				|	РегистрСведений.ДатыЗапретаРедактирования КАК ДатыЗапретаРедактирования
				|ГДЕ
				|	ДатыЗапретаРедактирования.Месяц = &Месяц
				|	И ДатыЗапретаРедактирования.ПодразделениеКомпании = &ПустоеПодразделение
				|	И НЕ ДатыЗапретаРедактирования.НоваяДатаЗапретРедактированияРасчета = ДАТАВРЕМЯ(1, 1, 1)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВТ.Приоритет КАК Приоритет,
				|	ВТ.НоваяДатаЗапретРедактированияРасчета КАК НоваяДатаЗапретРедактированияРасчета
				|ИЗ
				|	ВТ КАК ВТ
				|
				|СГРУППИРОВАТЬ ПО
				|	ВТ.Приоритет,
				|	ВТ.НоваяДатаЗапретРедактированияРасчета
				|
				|УПОРЯДОЧИТЬ ПО
				|	Приоритет");
				
				Запрос.УстановитьПараметр("Месяц",НачалоМесяца(Период));
				Запрос.УстановитьПараметр("Подразделение",ПодразделениеКомпании);
				Запрос.УстановитьПараметр("ПустоеПодразделение",Справочники.ПодразделенияКомпании.ПустаяСсылка());
				
				Выб=Запрос.Выполнить().Выбрать();
				
				Если Выб.Следующий() Тогда
					
					Если ТекущаяДата()<=Выб.НоваяДатаЗапретРедактированияРасчета Тогда
						
						ДокФорма.ТолькоПросмотр = Ложь;
						
					Иначе
						
						ДокФорма.ТолькоПросмотр = Истина;
						
					КонецЕсли;
					
				Иначе
						
					 ДокФорма.ТолькоПросмотр = Истина;
	
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			ДокФорма.ТолькоПросмотр = Истина;
			
		КонецЕсли;
		
	Иначе
		
		ДокФорма.ТолькоПросмотр = Ложь;

	КонецЕсли;

КонецПроцедуры

Функция ПроверитьРазрешениеРедактирования(Период,Знач Организация=Неопределено,ПодразделениеКомпании, РПФ,Кор) Экспорт
	
	Если ПустаяСтрока(Организация) Тогда
		Организация=Справочники.Организации.ОсновнаяОрганизация;
	КонецЕсли;
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	ДатыЗапретаРедактирования.ЗапретРедактированияРасчета КАК ЗапретРедактированияРасчета,
	|	ДатыЗапретаРедактирования.ЗапретРедактированияКорректировок КАК ЗапретРедактированияКорректировок,
	|	0 КАК Приоритет
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрСведений.ДатыЗапретаРедактирования КАК ДатыЗапретаРедактирования
	|ГДЕ
	|	ДатыЗапретаРедактирования.Месяц = &Месяц
	|	И ДатыЗапретаРедактирования.ПодразделениеКомпании = &Подразделение
	|	И (НЕ ДатыЗапретаРедактирования.ЗапретРедактированияРасчета = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ НЕ ДатыЗапретаРедактирования.ЗапретРедактированияКорректировок = ДАТАВРЕМЯ(1, 1, 1))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДатыЗапретаРедактирования.ЗапретРедактированияРасчета,
	|	ДатыЗапретаРедактирования.ЗапретРедактированияКорректировок,
	|	1
	|ИЗ
	|	РегистрСведений.ДатыЗапретаРедактирования КАК ДатыЗапретаРедактирования
	|ГДЕ
	|	ДатыЗапретаРедактирования.Месяц = &Месяц
	|	И ДатыЗапретаРедактирования.ПодразделениеКомпании = &ПустоеПодразделение
	|	И (НЕ ДатыЗапретаРедактирования.ЗапретРедактированияРасчета = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ НЕ ДатыЗапретаРедактирования.ЗапретРедактированияКорректировок = ДАТАВРЕМЯ(1, 1, 1))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ЗапретРедактированияРасчета КАК ЗапретРедактированияРасчета,
	|	ВТ.ЗапретРедактированияКорректировок КАК ЗапретРедактированияКорректировок,
	|	ВТ.Приоритет КАК Приоритет
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ЗапретРедактированияРасчета,
	|	ВТ.ЗапретРедактированияКорректировок,
	|	ВТ.Приоритет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет");
	
	Запрос.УстановитьПараметр("Месяц",НачалоМесяца(Период));
	Запрос.УстановитьПараметр("Подразделение",ПодразделениеКомпании);
	Запрос.УстановитьПараметр("ПустоеПодразделение",Справочники.ПодразделенияКомпании.ПустаяСсылка());
	
	Результат=Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Выб = Результат.Выбрать();
		
		Если Выб.Следующий() Тогда
			
			Если (ТекущаяДата()<=Выб.ЗапретРедактированияРасчета и РПФ) или (ТекущаяДата()<=Выб.ЗапретРедактированияКорректировок и Кор) Тогда
				
				Возврат истина;
				
			Иначе
				
				Запрос=Новый Запрос("ВЫБРАТЬ
				|	0 КАК Приоритет,
				|	ДатыЗапретаРедактирования.НоваяДатаЗапретРедактированияРасчета КАК НоваяДатаЗапретРедактированияРасчета
				|ПОМЕСТИТЬ ВТ
				|ИЗ
				|	РегистрСведений.ДатыЗапретаРедактирования КАК ДатыЗапретаРедактирования
				|ГДЕ
				|	ДатыЗапретаРедактирования.Месяц = &Месяц
				|	И ДатыЗапретаРедактирования.ПодразделениеКомпании = &Подразделение
				|	И НЕ ДатыЗапретаРедактирования.НоваяДатаЗапретРедактированияРасчета = ДАТАВРЕМЯ(1, 1, 1)
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	1,
				|	ДатыЗапретаРедактирования.НоваяДатаЗапретРедактированияРасчета
				|ИЗ
				|	РегистрСведений.ДатыЗапретаРедактирования КАК ДатыЗапретаРедактирования
				|ГДЕ
				|	ДатыЗапретаРедактирования.Месяц = &Месяц
				|	И ДатыЗапретаРедактирования.ПодразделениеКомпании = &ПустоеПодразделение
				|	И НЕ ДатыЗапретаРедактирования.НоваяДатаЗапретРедактированияРасчета = ДАТАВРЕМЯ(1, 1, 1)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВТ.Приоритет КАК Приоритет,
				|	ВТ.НоваяДатаЗапретРедактированияРасчета КАК НоваяДатаЗапретРедактированияРасчета
				|ИЗ
				|	ВТ КАК ВТ
				|
				|СГРУППИРОВАТЬ ПО
				|	ВТ.Приоритет,
				|	ВТ.НоваяДатаЗапретРедактированияРасчета
				|
				|УПОРЯДОЧИТЬ ПО
				|	Приоритет");
				
				Запрос.УстановитьПараметр("Месяц",НачалоМесяца(Период));
				Запрос.УстановитьПараметр("Подразделение",ПодразделениеКомпании);
				Запрос.УстановитьПараметр("ПустоеПодразделение",Справочники.ПодразделенияКомпании.ПустаяСсылка());
				
				Выб=Запрос.Выполнить().Выбрать();
				
				Если Выб.Следующий() Тогда
					
					Если ТекущаяДата()<=Выб.НоваяДатаЗапретРедактированияРасчета Тогда
						
						Возврат истина;
						
					Иначе
						
						Возврат Ложь;
						
					КонецЕсли;
					
				Иначе
						
					 Возврат Ложь;
	
				КонецЕсли;
				 
			КонецЕсли;
			
		Иначе
			
			Возврат Ложь;
			
		КонецЕсли;
		
	Иначе
		
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

Процедура МотивацияПередЗаписьюСправочниковПередЗаписью(Источник, Отказ) Экспорт
	
	Если ТипЗнч(Источник) = тип("СправочникОбъект.Сотрудники") Тогда 
		
		Если НЕ Источник.ИнформацияОФОТ.Количество() = 0 Тогда
			
			Для Каждого СтрокаТаблицы ИЗ Источник.ИнформацияОФОТ Цикл 
				
				НаборЗаписей = РегистрыСведений.ИнформацияОФОТ.СоздатьНаборЗаписей(); 
				НаборЗаписей.Отбор.Сотрудник.Установить(Источник.Ссылка); 
				НаборЗаписей.Отбор.Подразделение.Установить(Источник.Подразделение); 
				НаборЗаписей.Отбор.Должность.Установить(Источник.Должность); 
				НаборЗаписей.Отбор.Период.Установить(НачалоДня(СтрокаТаблицы.ДатаУстановки));
				
				НоваяЗапись = НаборЗаписей.Добавить(); 
				НоваяЗапись.Сотрудник = Источник.Ссылка; 
				НоваяЗапись.Подразделение = Источник.Подразделение; 
				НоваяЗапись.Должность = Источник.Должность; 
				НоваяЗапись.Должность = Источник.Должность; 
				НоваяЗапись.СуммаОклада = СтрокаТаблицы.СуммаОклада; 
				НоваяЗапись.Премия = СтрокаТаблицы.Премия; 
				НоваяЗапись.Период = НачалоДня(СтрокаТаблицы.ДатаУстановки);
				
				НаборЗаписей.Записать(); 
				
			КонецЦикла; 
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


#Область ОбщиеОбработчики	


Функция ДатаКакМесяцПредставление(ДатаДата) Экспорт
	Возврат Формат(ДатаДата, "ДФ='ММММ гггг'");
КонецФункции


Функция ДатаКакМесяцПодобратьДатуПоТексту(Текст, ДатаПоТексту = НеОпределено) Экспорт   
	
	СписокВозврата = Новый СписокЗначений;
	ТекущийГод = Год(ТекущаяДата());
	
	Если ПустаяСтрока(Текст) Тогда
		Возврат СписокВозврата;
	КонецЕсли;
	Если Найти(Текст, ".") <> 0 Тогда
		Подстроки = РазложитьСтрокуВМассивПодстрок(Текст, ".");
	ИначеЕсли Найти(Текст, ",") <> 0 Тогда
		Подстроки = РазложитьСтрокуВМассивПодстрок(Текст, ",");
	ИначеЕсли Найти(Текст, "-") <> 0 Тогда
		Подстроки = РазложитьСтрокуВМассивПодстрок(Текст, "-");
	ИначеЕсли Найти(Текст, "/") <> 0 Тогда
		Подстроки = РазложитьСтрокуВМассивПодстрок(Текст, "/");
	ИначеЕсли Найти(Текст, "\") <> 0 Тогда
		Подстроки = РазложитьСтрокуВМассивПодстрок(Текст, "\");
	Иначе
		Подстроки = РазложитьСтрокуВМассивПодстрок(Текст, " ");
	КонецЕсли;
	Если Подстроки.Количество() = 1 Тогда
		// единственное слово - пытаемся получить месяц
		Если ТолькоЦифрыВСтроке(Текст) Тогда
			МесяцЧислом = Число(Текст);
			Если МесяцЧислом >= 1 и МесяцЧислом <=12 Тогда
				ДатаПоТексту = Дата(ТекущийГод, МесяцЧислом, 1);
				Если СтрДлина(Текст) = 1 Тогда
					СписокВозврата.Добавить(Формат(ДатаПоТексту, "ДФ='М/гг'"));
				Иначе
					СписокВозврата.Добавить(Формат(ДатаПоТексту, "ДФ='ММ/гг'"));
				КонецЕсли;
			Иначе
				Возврат СписокВозврата;
			КонецЕсли;                
		Иначе
			СписокМесяцев = СписокМесяцевПоСтроке(Текст);
			Для Каждого Месяц Из СписокМесяцев Цикл
				ДатаПоТексту = Дата(ТекущийГод, Месяц, 1);
				СписокВозврата.Добавить(Формат(ДатаПоТексту, "ДФ='ММММ гг'"));
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли Подстроки.Количество() = 2 Тогда
		// два слова - первое считаем месяцем, второе - годом
		Если ТолькоЦифрыВСтроке(Подстроки[1]) Тогда
			Если ПустаяСтрока(Подстроки[1]) Тогда
				ГодЧислом = 0;
				Подстроки[1] = "0";
				ТекстВозврата = Текст + "0";
			Иначе
				ГодЧислом = Число(Подстроки[1]);
				ТекстВозврата = "";
			КонецЕсли;
			Если ГодЧислом > 3000 Тогда
				Возврат СписокВозврата;
			КонецЕсли;
			Если СтрДлина(Подстроки[1]) <= 1 Тогда
				ГодЧислом = Число(Лев(Формат(ТекущийГод, "ЧГ="), 3) + Подстроки[1]);
				СтрокаФорматированияГода = "г";
			ИначеЕсли СтрДлина(Подстроки[1]) = 2 Тогда
				ГодЧислом = Число(Лев(Формат(ТекущийГод, "ЧГ="), 2) + Подстроки[1]);
				СтрокаФорматированияГода = "гг";
			ИначеЕсли СтрДлина(Подстроки[1]) = 3 Тогда
				ГодЧислом = Число(Лев(Формат(ТекущийГод, "ЧГ="), 1) + Подстроки[1]);
				СтрокаФорматированияГода = "гггг";
			КонецЕсли;                    
		Иначе
			//  второе слово может быть только годом
			Возврат СписокВозврата;
		КонецЕсли;                
		Если не обЗначениеНеЗаполнено(Подстроки[0]) И ТолькоЦифрыВСтроке(Подстроки[0]) Тогда
			МесяцЧислом = Число(Подстроки[0]);
			Если МесяцЧислом >= 1 и МесяцЧислом <= 12 Тогда
				// если "правильный" месяц и год
				ДатаПоТексту = Дата(ГодЧислом, МесяцЧислом, 1);
				СписокВозврата.Добавить(ТекстВозврата);
			Иначе
				Возврат СписокВозврата;
			КонецЕсли;                
		Иначе
			СписокМесяцев = СписокМесяцевПоСтроке(Подстроки[0]);
			Если СписокМесяцев.Количество() = 1 Тогда
				ДатаПоТексту = Дата(ГодЧислом, СписокМесяцев[0], 1);
				СписокВозврата.Добавить("");
			Иначе
				Для Каждого Месяц Из СписокМесяцев Цикл
					ДатаПоТексту = Дата(ГодЧислом, Месяц, 1);
					СписокВозврата.Добавить(Формат(Дата(ГодЧислом, Месяц, 1), "ДФ='ММММ гг'"));
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СписокВозврата;
	
КонецФункции


Функция ТолькоЦифрыВСтроке(Знач СтрокаПроверки, УчитыватьЛидирующиеНули = Истина, УчитыватьПробелы = Истина) Экспорт
	
	Если ТипЗнч(СтрокаПроверки) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ОбЗначениеНеЗаполнено(СтрокаПроверки) Тогда
		Возврат Истина;
	КонецЕсли; 
	
	Если НЕ УчитыватьПробелы Тогда
		СтрокаПроверки = СтрЗаменить(СтрокаПроверки, " ", "");
	КонецЕсли;
	
	Если НЕ УчитыватьЛидирующиеНули Тогда
		НомерПервойЦифры = 0;
		Для а = 1 По СтрДлина(СтрокаПроверки) Цикл
			НомерПервойЦифры = НомерПервойЦифры + 1;
			КодСимвола = КодСимвола(Сред(СтрокаПроверки, а, 1));
			Если КодСимвола <> 48 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		СтрокаПроверки = Сред(СтрокаПроверки, НомерПервойЦифры);
	КонецЕсли;
	
	Для а = 1 По СтрДлина(СтрокаПроверки) Цикл
		КодСимвола = КодСимвола(Сред(СтрокаПроверки, а, 1));
		Если НЕ (КодСимвола >= 48 И КодСимвола <= 57) Тогда
			Возврат Ложь;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат Истина;
	
КонецФункции


Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",") Экспорт
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции


Функция СписокМесяцевПоСтроке(Текст) Экспорт
	
	СписокМесяцев = Новый СписокЗначений;
	Месяцы = Новый Соответствие;
	МесяцыВозврата = Новый Массив;
	
	
	Для Счетчик = 1 По 12 Цикл
		Представление = Формат(Дата(2000, Счетчик, 1), "ДФ='ММММ'");
		СписокМесяцев.Добавить(Счетчик, Представление);
		Представление = Формат(Дата(2000, Счетчик, 1), "ДФ='МММ'");
		СписокМесяцев.Добавить(Счетчик, Представление);
	КонецЦикла;
	
	Для Каждого ЭлементСписка Из СписокМесяцев Цикл
		Если ВРег(Текст) = ВРег(Лев(ЭлементСписка.Представление, СтрДлина(Текст))) Тогда
			Месяцы[ЭлементСписка.Значение] = 0;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Элемент Из Месяцы Цикл
		МесяцыВозврата.Добавить(Элемент.Ключ);
	КонецЦикла;
	
	Возврат МесяцыВозврата;
	
КонецФункции

Функция ФИО(Сотрудник) Экспорт
	
	Перем ПолноеИмя, Фамилия, ИмяОтчество, Имя, Отчество;
	Перем ПозицияПервогоПробела, ПозицияВторогоПробела;
	ПолноеИмя = Сотрудник;
	ПозицияПервогоПробела = Найти(ПолноеИмя, " ");
	Если ПозицияПервогоПробела = 0 Тогда
		Возврат ПолноеИмя;
	Иначе
		Фамилия = Лев(ПолноеИмя, ПозицияПервогоПробела);
		ИмяОтчество = Сред(ПолноеИмя, ПозицияПервогоПробела+1);
		ИмяОтчество = СокрЛ(ИмяОтчество);
		Имя = Лев(ИмяОтчество, 1)+".";
		ПозицияВторогоПробела = Найти(ИмяОтчество, " ");
		Если ПозицияВторогоПробела = 0 Тогда
			Возврат Фамилия+Имя;
		Иначе
			Отчество = Сред(ИмяОтчество, ПозицияВторогоПробела+1);
			Отчество = СокрЛ(Отчество);
			Отчество = Лев(Отчество, 1)+".";
			Возврат Фамилия+Имя+Отчество;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция Это_Клиент() Экспорт
	#Если Клиент Тогда
		Возврат истина;
	#Иначе
		Возврат ложь;
	#КонецЕсли
КонецФункции

#КонецОбласти

#Область ОбработчикиРегламентныеЗадания	

Процедура РасчитатьKPI() Экспорт
	
	Период=НачалоМесяца(ТекущаяДата());
	Периодичность=Перечисления.Периодичность.Месяц;
	Организация = Справочники.Организации.ОсновнаяОрганизация;
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
	
	Обработки.РассчитатьKPI.Сформировать(Период, Периодичность, Организация, ПодразделениеКомпании);
		
КонецПроцедуры

#КонецОбласти
